TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    if(statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG)
        {
            uart_write_string("\twriteByte (1 byte) FAILED, status = ");
            uart_write_int(statusByte);
            uart_write_string("\n");
        }
        return statusByte;
    }
    // return the status
    return statusByte;
}

// sending two write bytes
uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint8_t _writeVal)
{
    uint8_t statusByte;

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 1\n");

    //// START A WRITE ////
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 2\n");

    // make sure we get a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 3\n");

    // set the buffer to family byte
    UCB0TXBUF = _familyByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 4\n");

    // set buffer to index byte
    UCB0TXBUF = _indexByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 5\n");

    // set buffer to write byte
    UCB0TXBUF = _writeByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 6\n");

    // set buffer to val write byte
    UCB0TXBUF = _writeVal;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 7\n");

    // send the stop signal
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 8\n");

    // wait for 6 ms
    delay_ms(6);

    //// READ STATUS BYTE ////

    // set uctr to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    // wait for a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    UCB0CTLW0 |= UCTXSTP;

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 9\n");

    // wait for transmit to complete and for stop to be true
    while(!(UCB0IFG & UCRXIFG));

    // read the buffer
    statusByte = UCB0RXBUF;

    // wait for stop
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteByte (2 byte) part 10\n");

    if(statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG)
        {
            uart_write_string("\twriteByte (2 byte) FAILED, status = ");
            uart_write_int(statusByte);
            uart_write_string("\n");
        }
        return statusByte;
    }
    // return the status
    return statusByte;
}

// same as above, but instead writes a uint16_t
uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint16_t _val)
{
    uint8_t statusByte;

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 1\n");

    //// START A WRITE ////
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 2\n");

    // make sure we get a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 3\n");

    // set the buffer to family byte
    UCB0TXBUF = _familyByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 4\n");

    // set buffer to index byte
    UCB0TXBUF = _indexByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 5\n");

    // set buffer to write byte
    UCB0TXBUF = _writeByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 6\n");

    // set buffer to first half of val (MSB)
    UCB0TXBUF = (uint8_t)(_val >> 8);

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 7\n");

    // set buffer to second half of val (LSB)
    UCB0TXBUF = (uint8_t)(_val & 0xFF);

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 8\n");

    // send the stop signal
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 9\n");

    // wait for 6 ms
    delay_ms(6);

    //// READ STATUS BYTE ////

    // set uctr to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    // wait for a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    UCB0CTLW0 |= UCTXSTP;

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 10\n");

    // wait for transmit to complete and for stop to be true
    while(!(UCB0IFG & UCRXIFG));

    // read the buffer
    statusByte = UCB0RXBUF;

    // wait for stop
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteByte (uint16_t) part 11\n");

    if(statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG)
        {
            uart_write_string("\twriteByte (uint16_t) FAILED, status = ");
            uart_write_int(statusByte);
            uart_write_string("\n");
        }
        return statusByte;
    }
    // return the status
    return statusByte;
}

// write uint32_t byte
uint8_t SparkFun_Bio_Sensor_Hub::writeLongBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, int32_t _writeVal[], const size_t _len)
{
    uint8_t statusByte;

    if(DEBUG) uart_write_string("\twriteLongBytes part 1\n");

    //// START A WRITE ////
    UCB0I2CSA = this->_address;

