TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    // set to transmitter mode & start condition
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\twriteLongBytes part 2\n");

    // make sure we get a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    if(DEBUG) uart_write_string("\twriteLongBytes part 3\n");

    // set the buffer to family byte
    UCB0TXBUF = _familyByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteLongBytes part 4\n");

    // set buffer to index byte
    UCB0TXBUF = _indexByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteLongBytes part 5\n");

    // set buffer to write byte
    UCB0TXBUF = _writeByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteLongBytes part 6\n");

    for(size_t i = 0; i < _len; i++)
    {
        for(int8_t shift_by = 24; shift_by != -8; shift_by -= 8)
        {
            // send 8 bits
            UCB0TXBUF = (uint8_t)(_writeVal[i] >> shift_by);

            // wait for transmit interrupt
            while(!(UCB0IFG & UCTXIFG));
        }
    }

    if(DEBUG) uart_write_string("\twriteLongBytes part 7\n");

    // send stop
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteLongBytes part 8\n");

    // wait for 6 ms
    delay_ms(6);

    //// READ STATUS BYTE ////

    if(DEBUG) uart_write_string("\twriteLongBytes part 9\n");

    // set uctr to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    if(DEBUG) uart_write_string("\twriteLongBytes part 10\n");

    // wait for a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    if(DEBUG) uart_write_string("\twriteLongBytes part 11\n");

    UCB0CTLW0 |= UCTXSTP;

    // wait for transmit to complete and for stop to be true
    while(!(UCB0IFG & UCRXIFG));

    if(DEBUG) uart_write_string("\twriteLongBytes part 12\n");

    // read the buffer
    statusByte = UCB0RXBUF;

    // wait for stop
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteLongBytes part 13\n");

    if(statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG)
        {
            uart_write_string("\twriteLongBytes FAILED, status = ");
            uart_write_int(statusByte);
            uart_write_string("\n");
        }
        return statusByte;
    }
    // return the status
    return statusByte;
}

// write an array of bytes
uint8_t SparkFun_Bio_Sensor_Hub::writeBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint8_t _writeVal[], const size_t _len)
{

    uint8_t statusByte;

    if(DEBUG) uart_write_string("\twriteBytes part 1\n");

    //// START A WRITE ////
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition
    UCB0CTLW0 |= UCTR | UCTXSTT;

    if(DEBUG) uart_write_string("\twriteBytes part 2\n");

    // make sure we get a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    if(DEBUG) uart_write_string("\twriteBytes part 3\n");

    // set the buffer to family byte
    UCB0TXBUF = _familyByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteBytes part 4\n");

    // set buffer to index byte
    UCB0TXBUF = _indexByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteBytes part 5\n");

    // set buffer to write byte
    UCB0TXBUF = _writeByte;

    // wait for transmit interrupt
    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\twriteBytes part 6\n");

    for(size_t i = 0; i != _len; i++)
    {
        // set buffer to data byte
        UCB0TXBUF = _writeVal[i];
            
        // wait for transmit interrupt
        while(!(UCB0IFG & UCTXIFG));
    }

    if(DEBUG) uart_write_string("\twriteBytes part 7\n");

    // send stop
    UCB0CTLW0 |= UCTXSTP;

    // wait until stop condition
    while(UCB0CTLW0 & UCTXSTP);
    
    if(DEBUG) uart_write_string("\twriteBytes part 8\n");

    // wait for 6 ms
    delay_ms(6);

    //// READ STATUS BYTE ////

    if(DEBUG) uart_write_string("\twriteBytes part 9\n");

    // set uctr to 0 & start condition
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    if(DEBUG) uart_write_string("\twriteBytes part 10\n");

    // wait for a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    if(DEBUG) uart_write_string("\twriteBytes part 11\n");

    UCB0CTLW0 |= UCTXSTP;

    // wait for transmit to complete and for stop to be true
    while(!(UCB0IFG & UCRXIFG));

    if(DEBUG) uart_write_string("\twriteBytes part 12\n");

    // read the buffer
    statusByte = UCB0RXBUF;

    // wait for stop
    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\twriteBytes part 13\n");

    if(statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG)
        {
            uart_write_string("\twriteBytes FAILED, status = ");
            uart_write_int(statusByte);
            uart_write_string("\n");
        }
        return statusByte;
    }
    // return the status
    return statusByte;
}

// reads a status byte (or return byte) from the device
uint8_t SparkFun_Bio_Sensor_Hub::readByte(uint8_t _familyByte, uint8_t _indexByte)
{
    uint8_t returnByte;
    uint8_t statusByte;

    //// START A WRITE ////
    // set the address we transmit to
    UCB0I2CSA = this->_address;

    // set to transmitter mode & start condition (use |= to not reset the INIT)
    UCB0CTLW0 |= UCTR | UCTXSTT;

    // check to make sure we got a response from the address
    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        // stop transmission & reset NACK flag, then send err
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }
    
    // set the buffer to family byte
    UCB0TXBUF = _familyByte;

    // make sure we are good to send data (wait for transmit interrupt)
    while(!(UCB0IFG & UCTXIFG));

