TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 5 (transmitted index byte)\n");

    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 6 (transmitted write byte)\n");

    UCB0TXBUF = _writeByte;

    while(!(UCB0IFG & UCTXIFG));

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 7\n");

    UCB0CTLW0 |= UCTXSTP;

    while(UCB0CTLW0 & UCTXSTP);

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 8\n");

    delay_ms(6);

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 9\n");

    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 10\n");

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 11\n");

    while(!(UCB0IFG & UCRXIFG));

    statusByte = UCB0RXBUF;

    if(DEBUG)
    {
        uart_write_string("\treadMultipleBytes (uint32_t) part 12 statusByte = ");
        uart_write_int(statusByte);
        uart_write_string("\n");
    }

    if(statusByte != SFE_BIO_SUCCESS)
    {
        if(DEBUG) uart_write_string("\treadMultipleBytes (ERROR) statusByte != SFE_BIO_SUCCESS\n");
        UCB0CTLW0 |= UCTXSTP;

        while(!(UCB0IFG & UCRXIFG));

        uint8_t dummy = UCB0RXBUF;

        while(UCB0CTLW0 & UCTXSTP);

        return statusByte;
    }

    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 13\n");
    
    for (size_t i = 0; i != _len; i++)
    {
        // we set to 0 to allow OR logic later
        userArray[i] = 0;

        for(int8_t shift_by = 24; shift_by != -8; shift_by -= 8)
        {
            // send the stop condition
            if(i == (_len - 1) && shift_by == 0)
            {
                UCB0CTLW0 |= UCTXSTP;
            }
            
            while(!(UCB0IFG & UCRXIFG));

            userArray[i] = ((uint32_t)UCB0RXBUF << shift_by);
        }

        if(DEBUG)
        {
            uart_write_string("\treadMultipleBytes (uint32_t) finished loop userArray[i] = ");
            uart_write_int((int)userArray[i]);
            uart_write_string("\n");
        }
    }
    
    if(DEBUG) uart_write_string("\treadMultipleBytes (uint32_t) part 14\n");

    while(UCB0CTLW0 & UCTXSTP);

    return statusByte;
}

// write to an array passed through
uint8_t SparkFun_Bio_Sensor_Hub::readFillArray(uint8_t _familyByte, uint8_t _indexByte, uint8_t arraySize, uint8_t array[])
{

    if(arraySize == 0) return ERR_UNKNOWN;

    uint8_t statusByte;

    UCB0I2CSA = this->_address;

    UCB0CTLW0 |= UCTR | UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }
    
    UCB0TXBUF = _familyByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));

    UCB0CTLW0 |= UCTXSTP;

    while(UCB0CTLW0 & UCTXSTP);

    delay_ms(6);

    // read response
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while(UCB0CTLW0 & UCTXSTT);
    if(UCB0IFG & UCNACKIFG)
    {
        UCB0CTLW0 |= UCTXSTP;
        UCB0IFG &= ~UCNACKIFG;
        return ERR_TRY_AGAIN;
    }

    while(!(UCB0IFG & UCRXIFG));

    statusByte = UCB0RXBUF;

    if(statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;

        while(!(UCB0IFG & UCRXIFG));

        uint8_t dummy = UCB0RXBUF;

        while(UCB0CTLW0 & UCTXSTP);

        return statusByte;
    }

    for (uint8_t i = 0; i != arraySize; i++)
    {
        if (i == (arraySize - 1))
        {
            UCB0CTLW0 |= UCTXSTP;
        }

        while(!(UCB0IFG & UCRXIFG));
        
        array[i] = UCB0RXBUF;
    }

    while(UCB0CTLW0 & UCTXSTP);

    return statusByte;
}

void delay_ms(uint16_t ms)
{
    // set up timer B0
    // TBSSEL__ACLK for 32kHz clock
    // MC__UP count up
    // ID__1 clock divider = 1
    TB0CTL = TBSSEL__ACLK | MC__UP | ID__1 | TBCLR;

    // set the count value
    // with a 32kHz clock, we do about 32 counts per ms
    TB0CCR0 = 33 * ms;

    // clear the timer interrupt
    TB0CCTL0 &= ~CCIFG;

    // enable clock interrupt
    TB0CCTL0 |= CCIE;

    // enable low power mode & interrupts
    __bis_SR_register(LPM3_bits + GIE);

    // disable timer after we wake
    TB0CTL = MC__STOP;
}

#pragma vector = TIMER0_B0_VECTOR
__interrupt void Timer_B0_ISR(void)
{
    // wake CPU & exit low-power
    __bic_SR_register_on_exit(LPM3_bits);
}

// creating UART for debugging since printing doesn't seem to work
void initUART()
{
    // configure uart pins, 1.4 = TX & 1.5 = RX
    P1SEL0 |= BIT4 | BIT5;
    //    P1SEL0 &= ~(BIT4 | BIT5);

    // configure uart for 9600 baud
    UCA0CTLW0 |= UCSWRST;       // eUSCI in reset
    UCA0CTLW0 |= UCSSEL__SMCLK; // choose smclk

    UCA0BR0 = 8;
    UCA0BR1 = 0x00;
    UCA0MCTLW = 0xD600;

    UCA0CTLW0 &= ~UCSWRST; // release from reset
}

void uart_write_char(char c)
{
    while (!(UCA0IFG & UCTXIFG)); // wait for tx buffer to be empty
    UCA0TXBUF = c;
}

void uart_write_string(const char *str)
{
    while (*str)
    {
        if (*str == '\n') {
            uart_write_char('\r');
        }
        uart_write_char(*str++);
    }
}

void uart_write_int(int num)
{
    char buf[10];
    int i = 0;
    if (num == 0)
    {
        uart_write_char('0');
        return;
    }
    while (num > 0 && i < 10)
    {
        buf[i++] = (num % 10) + '0';
        num /= 10;
    }
    while (--i >= 0)
    {
        uart_write_char(buf[i]);
    }
}

void uart_clear_screen() {
    // ESC [ 2 J  = Clear entire screen
    // ESC [ H    = Move cursor to home (top-left)
    uart_write_string("\x1B[2J\x1B[H"); 
}

// Helper to set pins to a "High" state using internal pull-ups
void b_high(uint8_t pin) {
    P1DIR &= ~pin; // Set to input
    P1OUT |= pin;  // Ensure pull-up is active
}

// Helper to set pins to a "Low" state
void b_low(uint8_t pin) {
    P1OUT &= ~pin; // Write 0
    P1DIR |= pin;  // Set to output
}

void b_delay() { __delay_cycles(200); } // ~2.5kHz for maximum stability with weak pull-ups

void b_start() {
    b_high(SDA); b_high(SCL); b_delay();
    b_low(SDA); b_delay();
    b_low(SCL); b_delay();
}

void b_stop() {
    b_low(SDA); b_delay();
    b_high(SCL); b_delay();
    b_high(SDA); b_delay();
}

bool b_write(uint8_t data) {
    for (int i = 0; i < 8; i++) {
        if (data & 0x80) b_high(SDA);
        else b_low(SDA);
        b_delay();
        b_high(SCL); b_delay();
        b_low(SCL); b_delay();
        data <<= 1;
    }
    // Check for ACK
    b_high(SDA); b_delay();
    b_high(SCL); b_delay();
    bool ack = !(P1IN & SDA); // If SDA is pulled low, we have an ACK
    b_low(SCL); b_delay();
    return ack;
}

